VirtualKeyboard.Langs.ET = {
    cons : {
        // e a,i,aa,ee,u,o,oa/wa
        // - aiAeuoWY
        'ህ' : 'ህሀሂሃሄሁሆሇ'                 // h h 
       ,'ል' : 'ልለሊላሌሉሎሏ'                 // l l
       ,'ሕ' : 'ሕሐሒሓሔሑሖሗ'                 // hh H
       ,'ም' : 'ምመሚማሜሙሞሟፙ'              // m m
       ,'ሥ' : 'ሥሠሢሣሤሡሦሧ'                 // sz X
       ,'ር' : 'ርረሪራሬሩሮሯፘ'              // r r
       ,'ስ' : 'ስሰሲሳሴሱሶሷ'                 // s s
       ,'ሽ' : 'ሽሸሺሻሼሹሾሿ'                 // sh S
       ,'ቅ' : 'ቅቀቂቃቄቁቆቋ ቈቊቋቌቍ' // q q
       ,'ቍ' : 'ቍቈቊቋቌ'                          // qw Oq
       ,'ቕ' : 'ቕቐቒቓቔቑቖ  ቘቚቛቜቝ'   // qh Q
       ,'ቝ' : 'ቝቘቚቛቜ'                          // qhw OQ
       ,'ብ' : 'ብበቢባቤቡቦቧ'                 // b b
       ,'ቭ' : 'ቭቨቪቫቬቩቮቯ'                 // v v
       ,'ት' : 'ትተቲታቴቱቶቷ'                 // t t
       ,'ች' : 'ችቸቺቻቼቹቾቿ'                 // c c
       ,'ኅ' : 'ኅኀኂኃኄኁኆ  ኈኊኋኌኍ'   // x x
       ,'ኍ' : 'ኍኈኊኋኌ'                          // xw Ox
       ,'ን' : 'ንነኒናኔኑኖኗ'                 // n n
       ,'ኝ' : 'ኝኘኚኛኜኙኞኟ'                 // ny N
       ,'እ' : 'እአኢኣኤኡኦኧ'                 // glot '
       ,'ክ' : 'ክከኪካኬኩኮ  ኰኲኳኴኵ'   // k k
       ,'ኵ' : 'ኵኰኲኳኴ'                          // kw Ok
       ,'ኽ' : 'ኽኸኺኻኼኹኾ  ዀዂዃዄዅ'   // kx K
       ,'ዅ' : 'ዅዀዂዃዄ'                          // kxw OK
       ,'ው' : 'ውወዊዋዌዉዎ'                    // w w
       ,'ዕ' : 'ዕዐዒዓዔዑዖ'                    // pharyng '
       ,'ዝ' : 'ዝዘዚዛዜዙዞዟ'                 // z z
       ,'ዥ' : 'ዥዠዢዣዤዡዦዧ'                 // zh Z
       ,'ይ' : 'ይየዪያዬዩዮ'                    // y y
       ,'ድ' : 'ድደዲዳዴዱዶዷ'                 // d d
       ,'ዽ' : 'ዽዸዺዻዼዹዾዿ'                 // dd D
       ,'ጅ' : 'ጅጀጂጃጄጁጆጇ'                 // j j
       ,'ግ' : 'ግገጊጋጌጉጎጏ ጐጒጓጔጕ' // g g
       ,'ጕ' : 'ጕጐጒጓጔ'                          // gw Og
       ,'ጝ' : 'ጝጘጚጛጜጙጞጟ'                 // gg G
       ,'ጥ' : 'ጥጠጢጣጤጡጦጧ'                 // th T
       ,'ጭ' : 'ጭጨጪጫጬጩጮጯ'                 // ch C
       ,'ጵ' : 'ጵጰጲጳጴጱጶጷ'                 // ph P
       ,'ጽ' : 'ጽጸጺጻጼጹጾጿ'                 // ts [
       ,'ፅ' : 'ፅፀፂፃፄፁፆፇ'                 // tz ]
       ,'ፍ' : 'ፍፈፊፋፌፉፎፏፚ'              // f f
       ,'ፕ' : 'ፕፐፒፓፔፑፖፗ'                 // p p
       ,'ⶥ' : 'ⶥⶠⶢⶣⶤⶡⶦ'                    // ss Os
       ,'ⶭ' : 'ⶭⶨⶪⶫⶬⶩⶮ'                    // cc Oc
       ,'ⶵ' : 'ⶵⶰⶲⶳⶴⶱⶶ'                    // zz Oz
       ,'ⶽ' : 'ⶽⶸⶺⶻⶼⶹⶾ'                    // cch Ov
       ,'ⷅ' : 'ⷅⷀⷂⷃⷄⷁⷆ'                    // QY
       ,'ⷍ' : 'ⷍⷈⷊⷋⷌⷉⷎ'                    // KY
       ,'ⷕ' : 'ⷕⷐⷒⷓⷔⷑⷖ'                    // XY 
       ,'ⷝ' : 'ⷝⷘⷚⷛⷜⷙⷞ'                    // GY
    }
   ,conv : {'ቀ':'ቅ','ወ':'ው','ረ':'ር','ተ':'ት','የ':'ይ','u':'','i':'','o':'','ፐ':'ፕ','ጸ':'ጽ','ፀ':'ፅ'
           ,'ሰ':'ስ','ደ':'ድ','ፈ':'ፍ','ገ':'ግ','ሀ':'ህ','ጀ':'ጅ','ከ':'ክ','ለ':'ል','አ':'እ'
           ,'ዘ':'ዝ','ኀ':'ኅ','ቸ':'ች','ቨ':'ቭ','በ':'ብ','ነ':'ን','መ':'ም'
           ,'ቐ':'ቕ','ጠ':'ጥ','ጰ':'ጵ','ሸ':'ሽ','ዻ':'ዽ','ጘ':'ጝ','ሐ':'ሕ','ኸ':'ኽ','ዐ':'ዕ'
           ,'ዠ':'ዥ','ሠ':'ሥ','ጨ':'ጭ','ኘ':'ኝ'
           ,'ቈ':'ቍ','ቘ':'ቝ','ጐ':'ጕ','ኰ':'ኵ','ዀ':'ዅ','ኈ':'ኍ'
           ,'ⶠ':'ⶥ','ⶨ':'ⶭ','ⶰ':'ⶵ','ⶸ':'ⶽ'
           ,'ⷀ':'ⷅ','ⷈ':'ⷍ'
    }
}
