<?php

$lang['privacy_policy_title'] = '私隐政策';
$lang['privacy_text'] =
    '<h1>私隐政策</h1>

     <p>这篇私隐政策说明原文读经练习网怎样使用和保护您在本网站建立账户时提交的资料。</p>

     <p>本网站的一些功能，您不建立账户也可以使用。在这个情况下，我们不搜集您的任何个人资料。</p>


     <h2>我们收集什么资料</h2>
     <p>如果您在本网站建立账户，我们就可能收集以下资料：</p>

     <ul>
       <li>姓名</li>
       <li>电邮地址</li>
     </ul>

     <p>这些资料只用于：</p>
     <ul>
       <li>您使用本网站时，确定您的身分；</li>
       <li>有需要时寄电邮通知您本网站的情况。</li>
     </ul>

     <p>我们不会把您的资料提供给第三者作行销或业务推广之用，也不会出售您的资料。</p>

     <h2>删除账户</h2>

     <p>您可以删除您在这个网站的账户，方法是按“我的资料”，再按其中的“账户资料”，然后按“删除账户”。这样做就会由这个网站删除您姓名和电邮地址的所有资料。</p>

     <h2>其他网站的链结</h2>

     <p>这个网站里可能有一些链结，让您轻易造访其他有用的网站。不过，您一旦按那些链结而离开这个网站，您必须知道我们对那些网站没有任何控制权。因此当您造访那些网站时，我们并不负责保护您提供的任何资料，也不负责把您的资料保密。那些网站不受本私隐政策声明约束。您应当小心，阅读所造访网站的私隐政策。</p>';
