<?php

$lang['do_you_accept'] = "እነዚህን ህጎች ተቀብለዋል?";
$lang['first_you_must_accept_policy'] = "ይህን 'መጽሐፍ ቅዱስን በኢንተርኔት በቀጥታ መማር' ክፍል ከመጀመርዎ በፊት አስቀድመው ብሕትውነት ፖሊሲያችንን ይቀበሉ።";
$lang['new_privacy_header'] = "አዲስ ብሕትውነት ፖሊሲ";
$lang['new_privacy_intro'] = "አዲስ የብሕትውነት ፖሊሲ አውጥተናል። ስለዚህ ወደ ትምህርቱ መተግበሪያ ከመግባትዎ አስቀድመው ይህን ፖሊሲ ያንብቡ፣ ፖሊሲውን ከተቀበሉ መቀበልዎን ከዚህ ጽሑፍ መጨረሻ በተመለከተው ቦታ ላይ ይግለጹ።";
$lang['policy'] = "ፖሊሲ";
$lang['privacy_policy_title'] = "ብሕትውነት ፖሊሲ";
$lang['privacy_text'] = "<h1> ብሕትውነት ፖሊሲ </h1>\n"
        . "<p> ይህ ብሕትውነት ፖሊሲ፣ መጽሐፍ ቅዱስን በኢንተርኔት በቀጥታ የሚማር ሰው፣ መተግበሪያውን እንዴት መጠቀም እንዳለበትና በዚህ ድሕረ-ግጽ ሲመዘገብና ሲጠቀም ማንኛውንም መረጃ እንዴት ማስገባት እንዳለበት ዘዴውን ያሳያል።";
$lang['you_rejected_header'] = "የብሕትውነት ፖሊሲውን አልተቀበሉም";
$lang['you_rejected_oauth2_text'] = "የብሕትውነት ፖሊሲያችንን አልተቀበሉም፤ ስለዚህ 'መጽሐፍ ቅዱስን በኢንተርኔት በቀጥታ መማር' መተበሪያ ውስጥ ሊመዘገቡ አይችልም።";
$lang['you_rejected_text'] = "የብሕትውነት ፖሊሲያችንን አልተቀበሉም፤ ስለዚህ 'መጽሐፍ ቅዱስን በኢንተርኔት በቀጥታ መማር' መተግበሪያው ውስጥ ስምዎ ካለ ሊጠቀሙበት አይችሉም ማለት ነው። ስለዚህ ስምዎን እንዲንሰርዝ ከፈለጉ እባክዎን <a href=\"mailto:nwn@dbi.edu\">Nicolai Winther-Nielsen</a>.</p>.ከሚሉ አድራሻዎች በአንዱ ያግኙንና ያሳውቁን። ለ18 ወራት መተግበሪያውን ካልተጠቀሙ ስምዎ በራሱ ይሰረዛል። ";
