<?php

$lang['privacy_policy_title'] = '私隱政策';
$lang['privacy_text'] =
    '<h1>私隱政策</h1>

     <p>這篇私隱政策說明原文讀經練習網怎樣使用和保護您在本網站建立帳戶時提交的資料。</p>

     <p>本網站的一些功能，您不建立帳戶也可以使用。在這個情況下，我們不蒐集您的任何個人資料。</p>


     <h2>我們收集甚麼資料</h2>
     <p>如果您在本網站建立帳戶，我們就可能收集以下資料：</p>

     <ul>
       <li>姓名</li>
       <li>電郵地址</li>
     </ul>

     <p>這些資料只用於：</p>
     <ul>
       <li>您使用本網站時，確定您的身分；</li>
       <li>有需要時寄電郵通知您本網站的情況。</li>
     </ul>

     <p>我們不會把您的資料提供給第三者作行銷或業務推廣之用，也不會出售您的資料。</p>

     <h2>刪除帳戶</h2>

     <p>您可以刪除您在這個網站的帳戶，方法是按“我的資料”，再按其中的“帳戶資料”，然後按“刪除帳戶”。這樣做就會由這個網站刪除您姓名和電郵地址的所有資料。</p>

     <h2>其他網站的鏈結</h2>

     <p>這個網站裡可能有一些鏈結，讓您輕易造訪其他有用的網站。不過，您一旦按那些鏈結而離開這個網站，您必須知道我們對那些網站沒有任何控制權。因此當您造訪那些網站時，我們並不負責保護您提供的任何資料，也不負責把您的資料保密。那些網站不受本私隱政策聲明約束。您應當小心，閱讀所造訪網站的私隱政策。</p>';
